In [1]:
import pandas as pd

In [2]:
bank_users = pd.read_csv("bank_users.csv")

In [4]:
type(bank_users)

pandas.core.frame.DataFrame

In [5]:
ba = bank_users["bank_account"]

In [6]:
print(ba)

0      58.0
1      70.0
2      48.0
3      92.0
4      78.0
       ...
195    90.0
196    56.0
197     NaN
198    87.0
199     NaN
Name: bank_account, Length: 200, dtype: float64

In [7]:
type(ba)

pandas.core.series.Series

In [8]:
ba.mean()

np.float64(56.357541899441344)

In [9]:
ba.size

200

In [11]:
bank_users_1 = pd.read_csv("bank_users.csv", usecols=["first_name","last_name"])
bank_users_1

    first_name last_name
0        Shawn     Gotts
1     Sergeant    Linsey
2     Ambrosio    Gorton
3         Gram  Steanyng
4        Britt  Cockaday
..         ...       ...
195      Franz      Oppy
196   Adolphus   Labbati
197    Aurelea   Cordery
198  Armstrong  Laughren
199  Henrietta   Peckitt

[200 rows x 2 columns]

In [12]:
bank_users_1["first_name"]

0          Shawn
1       Sergeant
2       Ambrosio
3           Gram
4          Britt
         ...
195        Franz
196     Adolphus
197      Aurelea
198    Armstrong
199    Henrietta
Name: first_name, Length: 200, dtype: object